<a href="https://colab.research.google.com/github/araujorobert/Time-series-course/blob/main/2_Objeto_serie_de_tiempo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('Index2018.csv')
df_copy = df.copy()

In [3]:
df_copy.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

In [4]:
df_copy.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [5]:
df_copy.date.describe()
# Notemos que 07/12/2010 no es la primera fecha
# Esto es porque Python interpreta la variable 'date' como un string
# y cualquier fecha puede ser la top.

count           6269
unique          6269
top       16/05/2016
freq               1
Name: date, dtype: object

In [7]:
# Para convertir la variable date a una variable tipo time hacemos:
df_copy.date = pd.to_datetime(df_copy.date, dayfirst=True)

# dayfrist=True nos acomoda la variable -> como dia/mes/año

In [8]:
df_copy.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [9]:
# Describamos de nuevo la variable fecha
df_copy.date.describe()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

**Usamos las fechas como indices en nuestra serie de tiempo**

In [10]:
df_copy.set_index('date', inplace=True)

In [11]:
df_copy.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

**Estableciendo la frecuencia de nuestra serie de tiempo**

h: por hora

d: por dia

w: por semana

m: por mes

a: por año

In [12]:
df_copy = df_copy.asfreq('d')

In [13]:
df_copy.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

Note que se tienen NaN's, esto es porque esos dias fue fin de semana y por lo tanto no se muestreó.

Para arreglar esto se usa la opcion "business days -> b"

In [14]:
df_copy=df_copy.asfreq('b')
df_copy.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [15]:
df_copy.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

In [16]:
# Calculemos la suma
df_copy.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [17]:
# Vemos que hay 8 missing values en cada variable
# Para arreglar esto rellenamos los valores 
# el comando ffill significa front filling y lo que hace es rellenar el NaN con el valor siguiente
df_copy.spx = df_copy.spx.fillna(method='ffill')

In [18]:
df_copy.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [19]:
# También podemos llenar con la media
df_copy.ftse = df_copy.ftse.fillna(df_copy.ftse.mean())

In [20]:
df_copy.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

Sin embargo, en series de tiempo esta ultima opción no es muy conveniente salvo para series en los cuales los valores fluctuan al rededor de la media. Lo mejor es usar ya sea ffill o bfill

**Simplificando el dataset**

In [21]:
df_copy['Market value'] = df_copy.spx

In [22]:
df_copy.describe()

               spx           dax         ftse        nikkei  Market value
count  6277.000000   6269.000000  6277.000000   6269.000000   6277.000000
mean   1288.642547   6080.063363  5422.713545  14597.055700   1288.642547
std     487.868210   2754.361032  1144.842066   4043.122953    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4069.350000  4487.880000  10709.290000    992.715221
50%    1233.761241   5773.340000  5661.880000  15028.170000   1233.761241
75%    1460.250000   7443.070000  6303.300000  17860.470000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

Notamos que se agrego la columna "Market value"

In [23]:
# Para eliminar una columna usamos el comando "del"
del df_copy['spx']

In [24]:
df_copy.describe()

                dax         ftse        nikkei  Market value
count   6269.000000  6277.000000   6269.000000   6277.000000
mean    6080.063363  5422.713545  14597.055700   1288.642547
std     2754.361032  1144.842066   4043.122953    487.868210
min     1911.700000  2876.600000   7054.980000    438.920000
25%     4069.350000  4487.880000  10709.290000    992.715221
50%     5773.340000  5661.880000  15028.170000   1233.761241
75%     7443.070000  6303.300000  17860.470000   1460.250000
max    13559.600000  7778.637689  24124.150000   2872.867839

In [25]:
# Quedemonos entonces solo con la columna Market value
del df_copy['dax']
del df_copy['ftse']
del df_copy['nikkei']

In [26]:
df_copy.describe()

       Market value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

**Dividamos los datos en conjunto de entrenamiento y conjunto de prueba**

In [27]:
size=int(len(df_copy)*0.8)

El comando "iloc" sirve para formar sub-dataframes, esto se hace de la siguiente manera:

df.iloc[filas,columnas]

por ejemplo:

df.iloc[ 0:3 , 5:7 ] 

El sub-dataframe anterior se forma por las primeras 3 filas y las columnas 5 y 6

In [28]:
df_train = df_copy[:size]

In [29]:
df_test = df_copy[size:]

In [30]:
df_train.tail()

            Market value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [31]:
df_test.head()

            Market value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623

Vemos que el conjunto de entrenamiento termina el dia 5 de abril y el conjunto de prueba empieza el 8 de abril, por lo tanto, no hay solapamiento.